tap "1password/tap"
tap "cargo-lambda/cargo-lambda"
tap "finatext/gls", "https://github.com/Finatext/gls.git"
tap "finatext/orgu", "https://github.com/Finatext/orgu.git"
tap "golangci/tap"
tap "goreleaser/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "noborus/tap"
tap "reviewdog/tap"
tap "stacklok/tap"
brew "actionlint"
brew "jpeg-xl"
brew "aom"
brew "atuin"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "awscurl"
brew "berkeley-db"
brew "bottom"
brew "capstone"
brew "cmake"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "qemu"
brew "colima", restart_service: true
brew "coreutils", link: false
brew "csvlens"
brew "csvq"
brew "libssh2"
brew "rtmpdump"
brew "curl"
brew "deno"
brew "difftastic"
brew "docker"
brew "docker-buildx"
brew "docker-credential-helper"
brew "envchain"
brew "envoy"
brew "libgit2"
brew "exiftool"
brew "fd"
brew "harfbuzz"
brew "libass"
brew "libmicrohttpd"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "gitleaks"
brew "gnu-time"
brew "pinentry"
brew "gnupg"
brew "go"
brew "htop"
brew "hwatch"
brew "imagemagick"
brew "jnv"
brew "jo"
brew "jq"
brew "mockery"
brew "node"
brew "openssl@1.1"
brew "peco"
brew "perl"
brew "pinentry-mac"
brew "protobuf"
brew "python@3.10"
brew "python@3.11"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "shellcheck"
brew "sqlc"
brew "terraform"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "watchexec"
brew "xsv"
brew "yarn"
brew "youtube-dl"
brew "yq"
brew "zsh"
brew "finatext/orgu/orgu"
brew "golangci/tap/golangci-lint"
brew "goreleaser/tap/goreleaser"
brew "reviewdog/tap/reviewdog"
brew "stacklok/tap/frizbee"
cask "1password-cli"
cask "alacritty"
cask "aws-vault"
cask "ngrok"
cask "warp"
vscode "adpyke.codesnap"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "davidanson.vscode-markdownlint"
vscode "denoland.vscode-deno"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "felipecaputo.git-project-manager"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "ibm.output-colorizer"
vscode "kaiwood.endwise"
vscode "koichisasada.vscode-rdbg"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-typescript-next"
vscode "mtxr.sqltools"
vscode "mushan.vscode-paste-image"
vscode "mutantdino.resourcemonitor"
vscode "oderwat.indent-rainbow"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sorbet.sorbet-vscode-extension"
vscode "swellaby.vscode-rust-test-adapter"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tonybaloney.vscode-pets"
vscode "tyriar.sort-lines"
vscode "vadimcn.vscode-lldb"
